app/controllers/busquedas_controller.rb

  def index
    if params[:q]
      query = params[:q]+"~"
      @estudiantes = Estudiante.find_with_ferret(query, :limit => :all)
---
SELECT * FROM "estudiantes" WHERE (estudiantes.id in ('1'))