app/controllers/creditos_controller.rb

  def index
    @search = Credito.searchlogic(params[:search])
    @creditos = @search.all.paginate :page => params[:page], :per_page => 5
---
SELECT * FROM "creditos" ORDER BY creditos.estudiante_id ASC

  def show
    @credito = Credito.find(params[:id])
---
SELECT * FROM "creditos" WHERE ("creditos"."id" = 1)

  def edit
    @credito = Credito.find(params[:id])
---
SELECT * FROM "creditos" WHERE ("creditos"."id" = 4)

  def create
    @credito = Credito.new(params[:credito])

    respond_to do |format|
      if @credito.save
---
INSERT INTO "creditos" ("created_at", "updated_at", "estudiante_id", "curso_id") VALUES('2010-07-17 02:09:31', '2010-07-17 02:09:31', 1, 1)

  def update
    @credito = Credito.find(params[:id])

    respond_to do |format|
      if @credito.update_attributes(params[:credito])
---
SELECT * FROM "creditos" WHERE ("creditos"."id" = 4)
UPDATE "creditos" SET "updated_at" = '2010-07-18 01:00:17', "curso_id" = 3 WHERE "id" = 4