app/controllers/cursos_controller.rb

  def index
    @cursos = Curso.all
---
SELECT * FROM "cursos"

  def show
    @curso = Curso.find(params[:id])
---
SELECT * FROM "cursos" WHERE ("cursos"."id" = 1)

  def edit
    @curso = Curso.find(params[:id])
---
SELECT * FROM "cursos" WHERE ("cursos"."id" = 4)

  def create
    @curso = Curso.new(params[:curso])

    respond_to do |format|
      if @curso.save
---
INSERT INTO "cursos" ("fecha_inicio", "materia_id", "created_at", "fecha_finalizacion", "updated_at", "nivel_id", "horario", "docente_id") VALUES('2010-07-17', 1, '2010-07-17 02:08:24', '2010-07-17', '2010-07-17 02:08:24', 1, '', 1)

  def update
    @curso = Curso.find(params[:id])

    respond_to do |format|
      if @curso.update_attributes(params[:curso])
---
SELECT * FROM "cursos" WHERE ("cursos"."id" = 4)
UPDATE "cursos" SET "updated_at" = '2010-07-17 22:34:35', "horario" = 'Tardes' WHERE "id" = 1