app/controllers/docentes_controller.rb

SELECT * FROM "docentes"
---
  def index
    @docentes = Docente.all

SELECT * FROM "docentes" WHERE ("docentes"."id" = 1)
---
  def show
    @docente = Docente.find(params[:id])

SELECT * FROM "docentes" WHERE ("docentes"."id" = 1)
---
  def edit
    @docente = Docente.find(params[:id])

INSERT INTO "docentes" ("nombre2", "cedula", "fecha_nac", "created_at", "updated_at", "lugar_nac", "sexo_id", "apellido1", "apellido2", "nombre1", "email") VALUES('', '', '2010-07-17', '2010-07-17 02:59:43', '2010-07-17 02:59:43', '', NULL, '', '', 'Edgard', '')
---
  def create
    @docente = Docente.new(params[:docente])

    respond_to do |format|
      if @docente.save

SELECT * FROM "docentes" WHERE ("docentes"."id" = 1)
UPDATE "docentes" SET "updated_at" = '2010-07-20 20:31:02', "email" = 'edg.ortega@gmail.com', "fecha_nac" = '1981-07-17', "cedula" = 'M76-976-233', "apellido2" = 'Ortega', "nombre2" = 'José', "apellido1" = 'García', "sexo_id" = 2, "lugar_nac" = 'Totogalpa' WHERE "id" = 1
---
  def update
    @docente = Docente.find(params[:id])

    respond_to do |format|
      if @docente.update_attributes(params[:docente])