app/controllers/estudiantes_controller.rb

  def index
    @estudiantes = Estudiante.all
---
SELECT * FROM "estudiantes"

  def show
    @estudiante = Estudiante.find(params[:id])
---
SELECT * FROM "estudiantes" WHERE ("estudiantes"."id" = 1)

  def edit
    @estudiante = Estudiante.find(params[:id])
---
SELECT * FROM "estudiantes" WHERE ("estudiantes"."id" = 1)

  def create
    @estudiante = Estudiante.new(params[:estudiante])

    respond_to do |format|
      if @estudiante.save
---
INSERT INTO "estudiantes" ("nombre2", "cedula", "fecha_nac", "created_at", "updated_at", "lugar_nac", "sexo_id", "apellido1", "apellido2", "nombre1", "email") VALUES('', '', '2010-07-17', '2010-07-17 02:07:30', '2010-07-17 02:07:30', '', NULL, '', '', 'Pedro', '')

  def update
    @estudiante = Estudiante.find(params[:id])

    respond_to do |format|
      if @estudiante.update_attributes(params[:estudiante])
---
SELECT * FROM "estudiantes" WHERE ("estudiantes"."id" = 1)
UPDATE "estudiantes" SET "updated_at" = '2010-07-20 02:12:50', "email" = 'pedro.landero@gmail.com', "cedula" = 'M36-4567-23', "sexo_id" = 1, "lugar_nac" = 'Murra' WHERE "id" = 1