app/controllers/materias_controller.rb

SELECT * FROM "materias"
---
  def index
    @materias = Materia.all

SELECT * FROM "materias" WHERE ("materias"."id" = 1)
---
  def show
    @materia = Materia.find(params[:id])

SELECT * FROM "materias" WHERE ("materias"."id" = 3)
---
  def edit
    @materia = Materia.find(params[:id])

INSERT INTO "materias" ("created_at", "titulo", "updated_at", "descripcion") VALUES('2010-07-17 02:45:52', 'Office', '2010-07-17 02:45:52', 'Word, excel etc')
---
  def create
    @materia = Materia.new(params[:materia])

    respond_to do |format|
      if @materia.save

SELECT * FROM "materias" WHERE ("materias"."id" = 3)
UPDATE "materias" SET "updated_at" = '2010-07-17 02:46:53', "descripcion" = 'Access' WHERE "id" = 3
---
  def update
    @materia = Materia.find(params[:id])

    respond_to do |format|
      if @materia.update_attributes(params[:materia])