app/controllers/nivels_controller.rb

SELECT * FROM "nivels"
---
  def index
    @nivels = Nivel.all

SELECT * FROM "nivels" WHERE ("nivels"."id" = 1)
---
  def show
    @nivel = Nivel.find(params[:id])

INSERT INTO "nivels" ("created_at", "updated_at", "descripcion") VALUES('2010-07-17 02:44:43', '2010-07-17 02:44:43', 'Primer Nivel')
---
  def create
    @nivel = Nivel.new(params[:nivel])

    respond_to do |format|
      if @nivel.save