app/controllers/notas_controller.rb

SELECT * FROM "notas" ORDER BY `notas`.credito_id ASC
---
  def index
    @notas = Nota.all

SELECT * FROM "notas" WHERE ("notas"."id" = 10) ORDER BY credito_id ASC
---
  def show
    @nota = Nota.find(params[:id])

SELECT * FROM "notas" WHERE ("notas"."id" = 2)
---
  def edit
    @nota = Nota.find(params[:id])

INSERT INTO "notas" ("created_at", "calificacion", "updated_at", "tipo_nota_id", "credito_id", "fecha_nota") VALUES('2010-07-17 02:10:17', 9, '2010-07-17 02:10:17', 1, 1, '2010-07-17')
---
  def create
    @nota = Nota.new(params[:nota])

    respond_to do |format|
      if @nota.save