app/controllers/sexos_controller.rb

SELECT * FROM "sexos"
---
  def index
    @sexos = Sexo.all

SELECT * FROM "sexos" WHERE ("sexos"."id" = 1)
---
  def show
    @sexo = Sexo.find(params[:id])

INSERT INTO "sexos" ("created_at", "updated_at", "descripcion") VALUES('2010-07-17 02:43:46', '2010-07-17 02:43:46', 'Mujer')
---
  def create
    @sexo = Sexo.new(params[:sexo])

    respond_to do |format|
      if @sexo.save