app/controllers/tipo_notas_controller.rb

SELECT * FROM "tipo_notas"
---
  def index
    @tipo_notas = TipoNota.all

SELECT * FROM "tipo_notas" WHERE ("tipo_notas"."id" = 1)
---
  def show
    @tipo_nota = TipoNota.find(params[:id])

INSERT INTO "tipo_notas" ("created_at", "updated_at", "descripcion") VALUES('2010-07-17 02:42:52', '2010-07-17 02:42:52', 'Primera')
---
  def create
    @tipo_nota = TipoNota.new(params[:tipo_nota])

    respond_to do |format|
      if @tipo_nota.save