app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username", "password_salt", "password_hash", "email") VALUES('2010-07-28 01:03:12', '2010-07-28 01:03:12', 'thooby', '0f71addd119c52bec073a238bd70a21c913b9ee1', '289e21f4e786e3dcff861b1c35bf7ae8c9f05097', 'juan@zubi.net')
---
  def create
    @user = User.new(params[:user])
    if @user.save